#include <iostream>    // вкл. стандартна библиотека iostream за вход и изход
#include <cstdlib>     // вкл. библиотека за генериране случайно число от компютъра в зададен диапазон
#include <ctime>       // вкл. библиотека за преобразуване в реално време, с цел фунцията srand да генерира при всяка компилация различно число
using namespace std;   // използване на именно пространство std (Standart Template Library)
                       // ако изключим using namespace std от нашата преограма, то ще се наложи да пишем std пред всеки ред от кода
int main()             // поставяме началото на главната фукнция main
{
 //seed random number generator
    srand(time(0));
 // random number between 1 and 100
    int num = rand() % 100 + 1;
 // извеждане на текст на екрана
    cout << "Guess My Number Game\n\n";
 // инициализиране на променлива guess
    int guess = 0;
 // старт на цикъл while, докато guess е различно от случайното число
    while (guess != num) {
 // извеждане на текст на екрана за въвеждане на число
        cout << "Enter a guess between 1 and 100 : ";
 // въвеждане от клавиатурата на предположението
        cin >> guess;
 // проверка дали предположението е по-голямо от случайното число, ако е така се извежда, че предположението е по-голямо
        if (guess > num) {
            cout << "Too high!\n\n";
        }
 // проверка дали предположението е по-малко от случайното число, ако е така се извежда, че предположението е по-малко
        else if (guess < num)
            {
                cout << "Too low!\n\n";
            }
 // В случай, че горните 2 условия не са изпълнени, тоест случайното число е равно на предположението се извежда текст, че числото е познато
        else {
            cout << "\nCorrect! You got it in ";
        }
    }
 // прекратяване изпълнението на главната функция main
    return 0;
}
